; domain
(define (domain punto1)
 (:requirements :strips :typing :negative-preconditions)
 
 (:types
  ;food - content
  ;medicine - content
  ;tools - content
  content
  location
  person
  agent
  box
  carrier
  place ;posto sul carrier per la box
)

 (:constants
 )

 (:predicates
   (in ?o - object ?l - location)
   (need  ?p - person ?c - content)
   (has ?p - person ?c - content)
   (inBox ?b - box ?c - content)
   (fullBox ?b - box)
   (boxOnPlace ?b - box ?p - place) 
   (fullPlace ?p - place)
   (placeOnCarrier ?p - place ?c - carrier)
   (noPreference ?p - person) ;gestione or
   (hasSomething ?p - person) ;gestione or
   
  )

 (:action move
     :parameters (?a - agent ?c - carrier ?from ?to - location)
     :precondition (and (in ?a ?from) (in ?c ?from))
     :effect (and (in ?a ?to) (in ?c ?to) (not (in ?a ?from)) (not (in ?c ?from)))
 )

 (:action load
     :parameters (?a - agent ?c - carrier ?p - place ?b - box ?l - location)
     :precondition (and (in ?a ?l) (in ?c ?l) (in ?b ?l) (placeOnCarrier ?p ?c) (not (fullPlace ?p)) )
     :effect (and(boxOnPlace ?b ?p) (not(in ?b ?l)) (fullPlace ?p) ) 
)


(:action unload
     :parameters (?a - agent ?c - carrier ?p - place ?b - box ?l - location)
     :precondition (and (in ?a ?l) (in ?c ?l) (boxOnPlace ?b ?p) (placeOnCarrier ?p ?c) (fullPlace ?p) )
     :effect (and (not (boxOnPlace ?b ?p)) (in ?b ?l) (not (fullPlace ?p)) )
)


(:action vent
     :parameters (?a - agent ?b - box ?c - content ?p - person ?l - location)
     :precondition (and (inBox ?b ?c) (in ?a ?l) (in ?b ?l) (in ?p ?l) (need ?p ?c) (not (noPreference ?p)) )
     :effect (and (not (inBox ?b ?c)) (not (fullBox ?b)) (not (need ?p ?c)) (has ?p ?c))
)

(:action ventOr ;gestione or
     :parameters (?a - agent ?b - box ?c - content ?p - person ?l - location)
     :precondition (and (inBox ?b ?c) (in ?a ?l) (in ?b ?l) (in ?p ?l) (not (hasSomething ?p)) (need ?p ?c) (noPreference ?p))
     :effect (and (not (inBox ?b ?c)) (not (fullBox ?b)) (not (need ?p ?c)) (hasSomething ?p) )
)


(:action fill
     :parameters (?a - agent ?b - box ?c - content ?l - location)
     :precondition (and (not (fullBox ?b)) (in ?a ?l) (in ?b ?l) (in ?c ?l))
     :effect (and (fullBox ?b) (inBox ?b ?c))
)

)

; problem
(define (problem instance1)
  (:domain punto1)

  (:objects
   a1 - agent
   c1 - carrier
   place1 place2 place3 place4 - place
   depot l1 l2 - location
   p1 p2 p3 - person
   b1 b2 b3 b4 b5 - box
   food medicine tools - content
  )

  (:init
   (in a1 depot)
   (in c1 depot)
   (in b1 depot)
   (in b2 depot)
   (in b3 depot)
   (in b4 depot)
   (in b5 depot)
   (placeOnCarrier place1 c1)
   (placeOnCarrier place2 c1)
   (placeOnCarrier place3 c1)
   (placeOnCarrier place4 c1)
   
   (in food depot)
   (in medicine depot)
   (in tools depot)
   
   (in p1 l1)
   (in p2 l1)
   (in p3 l2)

   (need p1 food)
   (need p1 medicine)
   (need  p2 medicine)
   (need  p3 food)
)

  (:goal
    (and (has p1 food) (has p1 medicine) (has p2 medicine) (has p3 food))
  )
)

; plan
1. (load a1 c1 place1 b3 depot)
   deleted: (in b3 depot)
   added: (boxonplace b3 place1) (fullplace place1)
   goals met: 0 of 4
2. (fill a1 b4 medicine depot)
   added: (fullbox b4) (inbox b4 medicine)
   goals met: 0 of 4
3. (load a1 c1 place2 b4 depot)
   deleted: (in b4 depot)
   added: (boxonplace b4 place2) (fullplace place2)
   goals met: 0 of 4
4. (move a1 c1 depot l1)
   deleted: (in a1 depot) (in c1 depot)
   added: (in a1 l1) (in c1 l1)
   goals met: 0 of 4
5. (unload a1 c1 place2 b4 l1)
   deleted: (boxonplace b4 place2) (fullplace place2)
   added: (in b4 l1)
   goals met: 0 of 4
6. (move a1 c1 l1 depot)
   deleted: (in a1 l1) (in c1 l1)
   added: (in a1 depot) (in c1 depot)
   goals met: 0 of 4
7. (unload a1 c1 place1 b3 depot)
   deleted: (boxonplace b3 place1) (fullplace place1)
   added: (in b3 depot)
   goals met: 0 of 4
8. (fill a1 b3 food depot)
   added: (fullbox b3) (inbox b3 food)
   goals met: 0 of 4
9. (load a1 c1 place1 b3 depot)
   deleted: (in b3 depot)
   added: (boxonplace b3 place1) (fullplace place1)
   goals met: 0 of 4
10. (load a1 c1 place2 b5 depot)
   deleted: (in b5 depot)
   added: (boxonplace b5 place2) (fullplace place2)
   goals met: 0 of 4
11. (move a1 c1 depot l2)
   deleted: (in a1 depot) (in c1 depot)
   added: (in a1 l2) (in c1 l2)
   goals met: 0 of 4
12. (unload a1 c1 place1 b3 l2)
   deleted: (boxonplace b3 place1) (fullplace place1)
   added: (in b3 l2)
   goals met: 0 of 4
13. (vent a1 b3 food p3 l2)
   deleted: (inbox b3 food) (fullbox b3) (need p3 food)
   added: (has p3 food)
   goals met: 1 of 4
14. (move a1 c1 l2 depot)
   deleted: (in a1 l2) (in c1 l2)
   added: (in a1 depot) (in c1 depot)
   goals met: 1 of 4
15. (unload a1 c1 place2 b5 depot)
   deleted: (boxonplace b5 place2) (fullplace place2)
   added: (in b5 depot)
   goals met: 1 of 4
16. (fill a1 b5 food depot)
   added: (fullbox b5) (inbox b5 food)
   goals met: 1 of 4
17. (load a1 c1 place1 b5 depot)
   deleted: (in b5 depot)
   added: (boxonplace b5 place1) (fullplace place1)
   goals met: 1 of 4
18. (move a1 c1 depot l1)
   deleted: (in a1 depot) (in c1 depot)
   added: (in a1 l1) (in c1 l1)
   goals met: 1 of 4
19. (unload a1 c1 place1 b5 l1)
   deleted: (boxonplace b5 place1) (fullplace place1)
   added: (in b5 l1)
   goals met: 1 of 4
20. (vent a1 b5 food p1 l1)
   deleted: (inbox b5 food) (fullbox b5) (need p1 food)
   added: (has p1 food)
   goals met: 2 of 4
21. (move a1 c1 l1 depot)
   deleted: (in a1 l1) (in c1 l1)
   added: (in a1 depot) (in c1 depot)
   goals met: 2 of 4
22. (fill a1 b2 medicine depot)
   added: (fullbox b2) (inbox b2 medicine)
   goals met: 2 of 4
23. (load a1 c1 place1 b2 depot)
   deleted: (in b2 depot)
   added: (boxonplace b2 place1) (fullplace place1)
   goals met: 2 of 4
24. (move a1 c1 depot l1)
   deleted: (in a1 depot) (in c1 depot)
   added: (in a1 l1) (in c1 l1)
   goals met: 2 of 4
25. (unload a1 c1 place1 b2 l1)
   deleted: (boxonplace b2 place1) (fullplace place1)
   added: (in b2 l1)
   goals met: 2 of 4
26. (vent a1 b4 medicine p1 l1)
   deleted: (inbox b4 medicine) (fullbox b4) (need p1 medicine)
   added: (has p1 medicine)
   goals met: 3 of 4
27. (vent a1 b2 medicine p2 l1)
   deleted: (inbox b2 medicine) (fullbox b2) (need p2 medicine)
   added: (has p2 medicine)
   goals met: 4 of 4
